package com.example.demo.data;

import com.alibaba.fastjson.JSON;
import com.example.demo.entity.Emp;

import java.util.List;

public class EmpData {


    /*public static void main(String[] args) {
        List<Emp> emps = getEmps();
        for (Emp emp : emps) {
            System.out.println(emp);
        }

    }*/

    public static List<Emp> getEmps (){
        return JSON.parseArray(empStr, Emp.class);
    }
    private static String empStr = "["+
            "  {"+
            "    \"empno\": 134,"+
            "    \"ename\": \"路人甲\","+
            "    \"job\": \"打测试\","+
            "    \"mgr\": 99,"+
            "    \"hiredate\": \"2019-12-04T22:00:00.000+0000\","+
            "    \"sal\": 99999,"+
            "    \"comm\": null,"+
            "    \"deptno\": null"+
            "  },"+
            "  {"+
            "    \"empno\": 13,"+
            "    \"ename\": \"小昭\","+
            "    \"job\": \"测试\","+
            "    \"mgr\": 2,"+
            "    \"hiredate\": \"1982-01-23T06:00:00.000+0000\","+
            "    \"sal\": 30000,"+
            "    \"comm\": null,"+
            "    \"deptno\": 20"+
            "  },"+
            "  {"+
            "    \"empno\": 12,"+
            "    \"ename\": \"殷素素\","+
            "    \"job\": \"测试\","+
            "    \"mgr\": 3,"+
            "    \"hiredate\": \"1981-12-03T06:00:00.000+0000\","+
            "    \"sal\": 30000,"+
            "    \"comm\": null,"+
            "    \"deptno\": 20"+
            "  },"+
            "  {"+
            "    \"empno\": 11,"+
            "    \"ename\": \"殷野王\","+
            "    \"job\": \"测试\","+
            "    \"mgr\": 3,"+
            "    \"hiredate\": \"1987-04-19T05:00:00.000+0000\","+
            "    \"sal\": 30000,"+
            "    \"comm\": null,"+
            "    \"deptno\": 20"+
            "  },"+
            "  {"+
            "    \"empno\": 10,"+
            "    \"ename\": \"周巅\","+
            "    \"job\": \"程序员\","+
            "    \"mgr\": 4,"+
            "    \"hiredate\": \"1981-12-03T06:00:00.000+0000\","+
            "    \"sal\": 5000,"+
            "    \"comm\": 30000,"+
            "    \"deptno\": 10"+
            "  },"+
            "  {"+
            "    \"empno\": 10,"+
            "    \"ename\": \"周巅\","+
            "    \"job\": \"程序员\","+
            "    \"mgr\": 4,"+
            "    \"hiredate\": \"1981-12-03T06:00:00.000+0000\","+
            "    \"sal\": 5000,"+
            "    \"comm\": 30000,"+
            "    \"deptno\": 10"+
            "  },"+
            "  {"+
            "    \"empno\": 9,"+
            "    \"ename\": \"冷谦\","+
            "    \"job\": \"程序员\","+
            "    \"mgr\": 4,"+
            "    \"hiredate\": \"1981-09-08T05:00:00.000+0000\","+
            "    \"sal\": 5000,"+
            "    \"comm\": 10000,"+
            "    \"deptno\": 10"+
            "  },"+
            "  {"+
            "    \"empno\": 8,"+
            "    \"ename\": \"说不得\","+
            "    \"job\": \"程序员\","+
            "    \"mgr\": 4,"+
            "    \"hiredate\": \"1981-09-28T05:00:00.000+0000\","+
            "    \"sal\": 5000,"+
            "    \"comm\": 15000,"+
            "    \"deptno\": 10"+
            "  },"+
            "  {"+
            "    \"empno\": 7,"+
            "    \"ename\": \"张中\","+
            "    \"job\": \"程序员\","+
            "    \"mgr\": 4,"+
            "    \"hiredate\": \"1981-02-22T06:00:00.000+0000\","+
            "    \"sal\": 5000,"+
            "    \"comm\": 10000,"+
            "    \"deptno\": 10"+
            "  },"+
            "  {"+
            "    \"empno\": 6,"+
            "    \"ename\": \"彭和尚\","+
            "    \"job\": \"程序员\","+
            "    \"mgr\": 4,"+
            "    \"hiredate\": \"1981-02-20T06:00:00.000+0000\","+
            "    \"sal\": 5000,"+
            "    \"comm\": 20000,"+
            "    \"deptno\": 10"+
            "  },"+
            "  {"+
            "    \"empno\": 5,"+
            "    \"ename\": \"青翼蝙王\","+
            "    \"job\": \"经理\","+
            "    \"mgr\": 1,"+
            "    \"hiredate\": \"1980-12-17T06:00:00.000+0000\","+
            "    \"sal\": 50000,"+
            "    \"comm\": null,"+
            "    \"deptno\": 30"+
            "  },"+
            "  {"+
            "    \"empno\": 4,"+
            "    \"ename\": \"金毛狮王\","+
            "    \"job\": \"经理\","+
            "    \"mgr\": 1,"+
            "    \"hiredate\": \"1981-05-01T05:00:00.000+0000\","+
            "    \"sal\": 50000,"+
            "    \"comm\": null,"+
            "    \"deptno\": 30"+
            "  },"+
            "  {"+
            "    \"empno\": 3,"+
            "    \"ename\": \"白眉鹰王\","+
            "    \"job\": \"经理\","+
            "    \"mgr\": 1,"+
            "    \"hiredate\": \"1981-04-02T06:00:00.000+0000\","+
            "    \"sal\": 50000,"+
            "    \"comm\": null,"+
            "    \"deptno\": 30"+
            "  },"+
            "  {"+
            "    \"empno\": 2,"+
            "    \"ename\": \"紫衫龙王\","+
            "    \"job\": \"经理\","+
            "    \"mgr\": 1,"+
            "    \"hiredate\": \"1981-06-09T05:00:00.000+0000\","+
            "    \"sal\": 50000,"+
            "    \"comm\": null,"+
            "    \"deptno\": 30"+
            "  },"+
            "  {"+
            "    \"empno\": 1,"+
            "    \"ename\": \"张无忌\","+
            "    \"job\": \"董事长\","+
            "    \"mgr\": null,"+
            "    \"hiredate\": \"1981-11-17T06:00:00.000+0000\","+
            "    \"sal\": 100000,"+
            "    \"comm\": null,"+
            "    \"deptno\": 40"+
            "  }"+
            "]";
}
